
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |      11 |          1 |           5 |
## Affected resources by action

|  Action  | Resources                                                                                   |
|:--------:|:--------------------------------------------------------------------------------------------|
|    🟢     | `module.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]`        |
|    🟢     | `module.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]`    |
|    🟢     | `module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]`     |
|    🟢     | `module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]` |
|    🟢     | `module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]`     |
|    🟢     | `module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]` |
|    🟢     | `github_team.dev:`                                                                          |
|    🟡     | `aws_secretsmanager_secret.pypi_api_token`                                                  |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/40d22497-ab45-480a-8092-77e39732c17a/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan
github_team.dev: Refreshing state... [id=7332815]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
data.external.env: Reading...
data.external.env: Read complete after 0s [id=-]
github_repository.terraform-template: Refreshing state... [id=terraform-template]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
github_team_members.dev: Refreshing state... [id=7332815]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.repos["infrahouse-aws-control"].github_repository.repo: Refreshing state... [id=infrahouse-aws-control]
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
module.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]
module.ih_8_repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]
data.aws_ssm_parameter.gh_secrets_namespace: Reading...
data.aws_secretsmanager_secrets.gh_secrets: Reading...
data.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]
data.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_key: Reading...
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_key: Reading...
module.aws_creds_infrahouse8["aws-s3-control"].data.aws_secretsmanager_secret.aws_key: Reading...
module.aws_creds_infrahouse8["aws-control"].data.aws_secretsmanager_secret.aws_key: Reading...
module.aws_creds_infrahouse8["github-control"].data.aws_secretsmanager_secret.aws_key: Reading...
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]
module.ih_8_repos["aws-control"].github_branch_default.main: Refreshing state... [id=aws-control]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
module.aws_creds_infrahouse8["aws-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]
module.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]
module.ih_8_repos["aws-s3-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-s3-control:akuzminsky]
module.aws_creds_infrahouse8["aws-s3-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_s3-QMEaDX]
module.ih_8_repos["aws-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-control:akuzminsky]
module.aws_creds_infrahouse8["github-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_github-iYMNb3]
module.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_key: Reading...
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]
module.aws_creds_infrahouse8["aws-s3-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...
module.aws_creds_infrahouse8["github-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]
module.aws_creds_infrahouse8["aws-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...
module.aws_creds_infrahouse8["aws-s3-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_s3-QMEaDX|AWSCURRENT]
github_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]
module.aws_creds_infrahouse8["github-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_github-iYMNb3|AWSCURRENT]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
module.aws_creds_infrahouse8["aws-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]
module.repos["infrahouse-aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-aws-control]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
github_actions_secret.aws_access_key_id["infrahouse-aws-control"]: Refreshing state... [id=infrahouse-aws-control:AWS_ACCESS_KEY_ID]
github_actions_secret.aws_access_key_id["infrahouse-website-infra"]: Refreshing state... [id=infrahouse-website-infra:AWS_ACCESS_KEY_ID]
github_actions_secret.aws_secret_access_key["infrahouse-aws-control"]: Refreshing state... [id=infrahouse-aws-control:AWS_SECRET_ACCESS_KEY]
github_actions_secret.aws_secret_access_key["infrahouse-website-infra"]: Refreshing state... [id=infrahouse-website-infra:AWS_SECRET_ACCESS_KEY]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
module.ih_8_repos["aws-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCxf584CEeam]
module.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]
module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=github-control:AWS_ROLE]
module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=github-control:AWS_DEFAULT_REGION]
module.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]
module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-s3-control:AWS_DEFAULT_REGION]
module.ih_8_repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]
module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=aws-s3-control:AWS_ROLE]
module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-s3-control:GH_TOKEN]
module.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_secretsmanager_secret_version.pypi_api_token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_secretsmanager_secret_version" "pypi_api_token" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = "arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret.pypi_api_token will be updated in-place
  ~ resource "aws_secretsmanager_secret" "pypi_api_token" {
        id                             = "arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name                           = (sensitive value)
        tags                           = {}
        # (6 unchanged attributes hidden)
    }

  # github_actions_secret.aws_access_key_id["infrahouse-aws-control"] must be replaced
-/+ resource "github_actions_secret" "aws_access_key_id" {
      ~ created_at      = "2023-03-19 21:52:19 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-aws-control:AWS_ACCESS_KEY_ID" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-19 21:52:19 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.aws_access_key_id["infrahouse-website-infra"] must be replaced
-/+ resource "github_actions_secret" "aws_access_key_id" {
      ~ created_at      = "2023-03-19 21:52:15 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-website-infra:AWS_ACCESS_KEY_ID" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-19 21:52:15 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.aws_secret_access_key["infrahouse-aws-control"] must be replaced
-/+ resource "github_actions_secret" "aws_secret_access_key" {
      ~ created_at      = "2023-03-19 21:52:16 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-aws-control:AWS_SECRET_ACCESS_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-19 21:52:16 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.aws_secret_access_key["infrahouse-website-infra"] must be replaced
-/+ resource "github_actions_secret" "aws_secret_access_key" {
      ~ created_at      = "2023-03-19 21:52:17 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-website-infra:AWS_SECRET_ACCESS_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-19 21:52:17 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.pypi_api_token["infrahouse-toolkit"] must be replaced
-/+ resource "github_actions_secret" "pypi_api_token" {
      ~ created_at      = "2023-02-11 21:52:05 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-toolkit:PYPI_API_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-02-11 21:52:05 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-control"
      + secret_name     = "AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-control"
      + secret_name     = "AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-s3-control"
      + secret_name     = "AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-s3-control"
      + secret_name     = "AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "github-control"
      + secret_name     = "AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "github-control"
      + secret_name     = "AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

Plan: 11 to add, 1 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: github_team.dev: Refreshing state... [id=7332815]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Adata.external.env: Reading...%0Adata.external.env: Read complete after 0s [id=-]%0Agithub_repository.terraform-template: Refreshing state... [id=terraform-template]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["infrahouse-aws-control"].github_repository.repo: Refreshing state... [id=infrahouse-aws-control]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]%0Amodule.ih_8_repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]%0Adata.aws_ssm_parameter.gh_secrets_namespace: Reading...%0Adata.aws_secretsmanager_secrets.gh_secrets: Reading...%0Adata.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]%0Adata.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_key: Reading...%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_key: Reading...%0Amodule.aws_creds_infrahouse8["aws-s3-control"].data.aws_secretsmanager_secret.aws_key: Reading...%0Amodule.aws_creds_infrahouse8["aws-control"].data.aws_secretsmanager_secret.aws_key: Reading...%0Amodule.aws_creds_infrahouse8["github-control"].data.aws_secretsmanager_secret.aws_key: Reading...%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]%0Amodule.ih_8_repos["aws-control"].github_branch_default.main: Refreshing state... [id=aws-control]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.aws_creds_infrahouse8["aws-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]%0Amodule.ih_8_repos["aws-s3-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-s3-control:akuzminsky]%0Amodule.aws_creds_infrahouse8["aws-s3-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_s3-QMEaDX]%0Amodule.ih_8_repos["aws-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-control:akuzminsky]%0Amodule.aws_creds_infrahouse8["github-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_github-iYMNb3]%0Amodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_key: Reading...%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]%0Amodule.aws_creds_infrahouse8["aws-s3-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...%0Amodule.aws_creds_infrahouse8["github-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]%0Amodule.aws_creds_infrahouse8["aws-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...%0Amodule.aws_creds_infrahouse8["aws-s3-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_s3-QMEaDX|AWSCURRENT]%0Agithub_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.aws_creds_infrahouse8["github-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_github-iYMNb3|AWSCURRENT]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.aws_creds_infrahouse8["aws-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]%0Amodule.repos["infrahouse-aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-aws-control]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Agithub_actions_secret.aws_access_key_id["infrahouse-aws-control"]: Refreshing state... [id=infrahouse-aws-control:AWS_ACCESS_KEY_ID]%0Agithub_actions_secret.aws_access_key_id["infrahouse-website-infra"]: Refreshing state... [id=infrahouse-website-infra:AWS_ACCESS_KEY_ID]%0Agithub_actions_secret.aws_secret_access_key["infrahouse-aws-control"]: Refreshing state... [id=infrahouse-aws-control:AWS_SECRET_ACCESS_KEY]%0Agithub_actions_secret.aws_secret_access_key["infrahouse-website-infra"]: Refreshing state... [id=infrahouse-website-infra:AWS_SECRET_ACCESS_KEY]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Amodule.ih_8_repos["aws-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCxf584CEeam]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=github-control:AWS_ROLE]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=github-control:AWS_DEFAULT_REGION]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-s3-control:AWS_DEFAULT_REGION]%0Amodule.ih_8_repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=aws-s3-control:AWS_ROLE]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-s3-control:GH_TOKEN]%0Amodule.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.aws_secretsmanager_secret_version.pypi_api_token will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_secretsmanager_secret_version" "pypi_api_token" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + secret_binary  = (sensitive value)%0A      + secret_id      = "arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P"%0A      + secret_string  = (sensitive value)%0A      + version_id     = (known after apply)%0A      + version_stages = (known after apply)%0A    }%0A%0A  # aws_secretsmanager_secret.pypi_api_token will be updated in-place%0A  ~ resource "aws_secretsmanager_secret" "pypi_api_token" {%0A        id                             = "arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P"%0A      # Warning: this attribute value will be marked as sensitive and will not%0A      # display in UI output after applying this change. The value is unchanged.%0A      ~ name                           = (sensitive value)%0A        tags                           = {}%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # github_actions_secret.aws_access_key_id["infrahouse-aws-control"] must be replaced%0A-/+ resource "github_actions_secret" "aws_access_key_id" {%0A      ~ created_at      = "2023-03-19 21:52:19 +0000 UTC" -> (known after apply)%0A      ~ id              = "infrahouse-aws-control:AWS_ACCESS_KEY_ID" -> (known after apply)%0A      ~ plaintext_value = (sensitive value) # forces replacement%0A      ~ updated_at      = "2023-03-19 21:52:19 +0000 UTC" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # github_actions_secret.aws_access_key_id["infrahouse-website-infra"] must be replaced%0A-/+ resource "github_actions_secret" "aws_access_key_id" {%0A      ~ created_at      = "2023-03-19 21:52:15 +0000 UTC" -> (known after apply)%0A      ~ id              = "infrahouse-website-infra:AWS_ACCESS_KEY_ID" -> (known after apply)%0A      ~ plaintext_value = (sensitive value) # forces replacement%0A      ~ updated_at      = "2023-03-19 21:52:15 +0000 UTC" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # github_actions_secret.aws_secret_access_key["infrahouse-aws-control"] must be replaced%0A-/+ resource "github_actions_secret" "aws_secret_access_key" {%0A      ~ created_at      = "2023-03-19 21:52:16 +0000 UTC" -> (known after apply)%0A      ~ id              = "infrahouse-aws-control:AWS_SECRET_ACCESS_KEY" -> (known after apply)%0A      ~ plaintext_value = (sensitive value) # forces replacement%0A      ~ updated_at      = "2023-03-19 21:52:16 +0000 UTC" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # github_actions_secret.aws_secret_access_key["infrahouse-website-infra"] must be replaced%0A-/+ resource "github_actions_secret" "aws_secret_access_key" {%0A      ~ created_at      = "2023-03-19 21:52:17 +0000 UTC" -> (known after apply)%0A      ~ id              = "infrahouse-website-infra:AWS_SECRET_ACCESS_KEY" -> (known after apply)%0A      ~ plaintext_value = (sensitive value) # forces replacement%0A      ~ updated_at      = "2023-03-19 21:52:17 +0000 UTC" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # github_actions_secret.pypi_api_token["infrahouse-toolkit"] must be replaced%0A-/+ resource "github_actions_secret" "pypi_api_token" {%0A      ~ created_at      = "2023-02-11 21:52:05 +0000 UTC" -> (known after apply)%0A      ~ id              = "infrahouse-toolkit:PYPI_API_TOKEN" -> (known after apply)%0A      ~ plaintext_value = (sensitive value) # forces replacement%0A      ~ updated_at      = "2023-02-11 21:52:05 +0000 UTC" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "aws-control"%0A      + secret_name     = "AWS_ACCESS_KEY_ID"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "aws-control"%0A      + secret_name     = "AWS_SECRET_ACCESS_KEY"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "aws-s3-control"%0A      + secret_name     = "AWS_ACCESS_KEY_ID"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "aws-s3-control"%0A      + secret_name     = "AWS_SECRET_ACCESS_KEY"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "github-control"%0A      + secret_name     = "AWS_ACCESS_KEY_ID"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "github-control"%0A      + secret_name     = "AWS_SECRET_ACCESS_KEY"%0A      + updated_at      = (known after apply)%0A    }%0A%0APlan: 11 to add, 1 to change, 5 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvNDBkMjI0OTctYWI0NS00ODBhLTgwOTItNzdlMzk3MzJjMTdhL3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfbWVtYmVyc2hpcC5pbmZyYWhvdXNlW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZTpha3V6bWluc2t5XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5leHRlcm5hbC5lbnY6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0tXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3JlcG9zaXRvcnkudGVycmFmb3JtLXRlbXBsYXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tdGVtcGxhdGVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWRhdGEuYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldHMuZ2hfc2VjcmV0czogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0cy5naF9zZWNyZXRzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1naF9zZWNyZXRzX25hbWVzcGFjZV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzX2luZnJhaG91c2U4W1wiYXdzLXMzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNfaW5mcmFob3VzZThbXCJhd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc19pbmZyYWhvdXNlOFtcImdpdGh1Yi1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnB5cGlfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tZGhJSTlQXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc19pbmZyYWhvdXNlOFtcImF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMl1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3IuY29sbGFib3JhdG9yc1tcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOmFrdXptaW5za3ldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzX2luZnJhaG91c2U4W1wiYXdzLXMzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9zMy1RTUVhRFhdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6YWt1em1pbnNreV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNfaW5mcmFob3VzZThbXCJnaXRodWItY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2dpdGh1Yi1pWU1OYjNdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6YWt1em1pbnNreV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMnxBV1NDVVJSRU5UXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc19pbmZyYWhvdXNlOFtcImF3cy1zMy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNfaW5mcmFob3VzZThbXCJnaXRodWItY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMnxBV1NDVVJSRU5UXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc19pbmZyYWhvdXNlOFtcImF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNfaW5mcmFob3VzZThbXCJhd3MtczMtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfczMtUU1FYURYfEFXU0NVUlJFTlRdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQucHlwaV9hcGlfdG9rZW5bXCJpbmZyYWhvdXNlLXRvb2xraXRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpQWVBJX0FQSV9UT0tFTl1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzX2luZnJhaG91c2U4W1wiZ2l0aHViLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2dpdGh1Yi1pWU1OYjN8QVdTQ1VSUkVOVF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzX2luZnJhaG91c2U4W1wiYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJ8QVdTQ1VSUkVOVF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS1hd3MtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX2FjY2Vzc19rZXlfaWRbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sOkFXU19BQ0NFU1NfS0VZX0lEXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX2FjdGlvbnNfc2VjcmV0LmF3c19hY2Nlc3Nfa2V5X2lkW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmE6QVdTX0FDQ0VTU19LRVlfSURdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX3NlY3JldF9hY2Nlc3Nfa2V5W1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbDpBV1NfU0VDUkVUX0FDQ0VTU19LRVldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX3NlY3JldF9hY2Nlc3Nfa2V5W1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmE6QVdTX1NFQ1JFVF9BQ0NFU1NfS0VZXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0pDeGY1ODRDRWVhbV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9wcm90ZWN0aW9uLm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUJQUl9rd0RPSkNlaVVjNENFWnZRXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX1JPTEVcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOkFXU19ST0xFXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpBV1NfREVGQVVMVF9SRUdJT05dXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOkFXU19ERUZBVUxUX1JFR0lPTl1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpHSF9UT0tFTl1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ST0xFXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpBV1NfUk9MRV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpHSF9UT0tFTl1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6QVdTX0RFRkFVTFRfUkVHSU9OXVx1MDAxYlswbVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gIFx1MDAxYlszMm0rXHUwMDFiWzBtIGNyZWF0ZVx1MDAxYlswbVxuICBcdTAwMWJbMzNtflx1MDAxYlswbSB1cGRhdGUgaW4tcGxhY2VcdTAwMWJbMG1cblx1MDAxYlszMW0tXHUwMDFiWzBtL1x1MDAxYlszMm0rXHUwMDFiWzBtIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50XHUwMDFiWzBtXG4gXHUwMDFiWzM2bTw9XHUwMDFiWzBtIHJlYWQgKGRhdGEgcmVzb3VyY2VzKVx1MDAxYlswbVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuXHUwMDFiWzFtICAjIGRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuXHUwMDFiWzBtIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHlcbiAgIyAoZGVwZW5kcyBvbiBhIHJlc291cmNlIG9yIGEgbW9kdWxlIHdpdGggY2hhbmdlcyBwZW5kaW5nKVxuXHUwMDFiWzBtIFx1MDAxYlszNm08PVx1MDAxYlswbVx1MDAxYlswbSBkYXRhIFwiYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uXCIgXCJweXBpX2FwaV90b2tlblwiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFybiAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfYmluYXJ5ICA9IChzZW5zaXRpdmUgdmFsdWUpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfaWQgICAgICA9IFwiYXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfc3RyaW5nICA9IChzZW5zaXRpdmUgdmFsdWUpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB2ZXJzaW9uX2lkICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHZlcnNpb25fc3RhZ2VzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuXHUwMDFiWzFtICAjIGF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucHlwaV9hcGlfdG9rZW5cdTAwMWJbMG0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG5cdTAwMWJbMG0gIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldFwiIFwicHlwaV9hcGlfdG9rZW5cIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UFwiXG4gICAgICAjIFx1MDAxYlszM21XYXJuaW5nXHUwMDFiWzBtOiB0aGlzIGF0dHJpYnV0ZSB2YWx1ZSB3aWxsIGJlIG1hcmtlZCBhcyBzZW5zaXRpdmUgYW5kIHdpbGwgbm90XG4gICAgICAjIGRpc3BsYXkgaW4gVUkgb3V0cHV0IGFmdGVyIGFwcGx5aW5nIHRoaXMgY2hhbmdlLlx1MDAxYlswbSBUaGUgdmFsdWUgaXMgdW5jaGFuZ2VkLlxuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSlcbiAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge31cbiAgICAgICAgXHUwMDFiWzkwbSMgKDYgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbVxuICAgIH1cblxuXHUwMDFiWzFtICAjIGdpdGh1Yl9hY3Rpb25zX3NlY3JldC5hd3NfYWNjZXNzX2tleV9pZFtcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl1cdTAwMWJbMG0gbXVzdCBiZSBcdTAwMWJbMW1cdTAwMWJbMzFtcmVwbGFjZWRcdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlszMW0tXHUwMDFiWzBtL1x1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJhd3NfYWNjZXNzX2tleV9pZFwiIHtcbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0wMy0xOSAyMTo1MjoxOSArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2w6QVdTX0FDQ0VTU19LRVlfSURcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSBcdTAwMWJbMzFtIyBmb3JjZXMgcmVwbGFjZW1lbnRcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHVwZGF0ZWRfYXQgICAgICA9IFwiMjAyMy0wMy0xOSAyMTo1MjoxOSArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgIFx1MDAxYls5MG0jICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICB9XG5cblx1MDAxYlsxbSAgIyBnaXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX2FjY2Vzc19rZXlfaWRbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl1cdTAwMWJbMG0gbXVzdCBiZSBcdTAwMWJbMW1cdTAwMWJbMzFtcmVwbGFjZWRcdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlszMW0tXHUwMDFiWzBtL1x1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJhd3NfYWNjZXNzX2tleV9pZFwiIHtcbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0wMy0xOSAyMTo1MjoxNSArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpBV1NfQUNDRVNTX0tFWV9JRFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpIFx1MDAxYlszMW0jIGZvcmNlcyByZXBsYWNlbWVudFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTAzLTE5IDIxOjUyOjE1ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgXHUwMDFiWzkwbSMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbVxuICAgIH1cblxuXHUwMDFiWzFtICAjIGdpdGh1Yl9hY3Rpb25zX3NlY3JldC5hd3Nfc2VjcmV0X2FjY2Vzc19rZXlbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdXHUwMDFiWzBtIG11c3QgYmUgXHUwMDFiWzFtXHUwMDFiWzMxbXJlcGxhY2VkXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMzFtLVx1MDAxYlswbS9cdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwiYXdzX3NlY3JldF9hY2Nlc3Nfa2V5XCIge1xuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlZF9hdCAgICAgID0gXCIyMDIzLTAzLTE5IDIxOjUyOjE2ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbDpBV1NfU0VDUkVUX0FDQ0VTU19LRVlcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSBcdTAwMWJbMzFtIyBmb3JjZXMgcmVwbGFjZW1lbnRcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHVwZGF0ZWRfYXQgICAgICA9IFwiMjAyMy0wMy0xOSAyMTo1MjoxNiArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgIFx1MDAxYls5MG0jICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICB9XG5cblx1MDAxYlsxbSAgIyBnaXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX3NlY3JldF9hY2Nlc3Nfa2V5W1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdXHUwMDFiWzBtIG11c3QgYmUgXHUwMDFiWzFtXHUwMDFiWzMxbXJlcGxhY2VkXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMzFtLVx1MDAxYlswbS9cdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwiYXdzX3NlY3JldF9hY2Nlc3Nfa2V5XCIge1xuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlZF9hdCAgICAgID0gXCIyMDIzLTAzLTE5IDIxOjUyOjE3ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19TRUNSRVRfQUNDRVNTX0tFWVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpIFx1MDAxYlszMW0jIGZvcmNlcyByZXBsYWNlbWVudFx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTAzLTE5IDIxOjUyOjE3ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgXHUwMDFiWzkwbSMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbVxuICAgIH1cblxuXHUwMDFiWzFtICAjIGdpdGh1Yl9hY3Rpb25zX3NlY3JldC5weXBpX2FwaV90b2tlbltcImluZnJhaG91c2UtdG9vbGtpdFwiXVx1MDAxYlswbSBtdXN0IGJlIFx1MDAxYlsxbVx1MDAxYlszMW1yZXBsYWNlZFx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzMxbS1cdTAwMWJbMG0vXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInB5cGlfYXBpX3Rva2VuXCIge1xuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlZF9hdCAgICAgID0gXCIyMDIzLTAyLTExIDIxOjUyOjA1ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgXHUwMDFiWzMxbSMgZm9yY2VzIHJlcGxhY2VtZW50XHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDItMTEgMjE6NTI6MDUgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICBcdTAwMWJbOTBtIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0FDQ0VTU19LRVlfSURcIl1cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJhd3MtY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19BQ0NFU1NfS0VZX0lEXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHVwZGF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfU0VDUkVUX0FDQ0VTU19LRVlcIl1cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJhd3MtY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19TRUNSRVRfQUNDRVNTX0tFWVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0FDQ0VTU19LRVlfSURcIl1cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJhd3MtczMtY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19BQ0NFU1NfS0VZX0lEXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHVwZGF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfU0VDUkVUX0FDQ0VTU19LRVlcIl1cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJhd3MtczMtY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19TRUNSRVRfQUNDRVNTX0tFWVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0FDQ0VTU19LRVlfSURcIl1cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJnaXRodWItY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19BQ0NFU1NfS0VZX0lEXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHVwZGF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfU0VDUkVUX0FDQ0VTU19LRVlcIl1cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJnaXRodWItY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19TRUNSRVRfQUNDRVNTX0tFWVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG5cdTAwMWJbMW1QbGFuOlx1MDAxYlswbSAxMSB0byBhZGQsIDEgdG8gY2hhbmdlLCA1IHRvIGRlc3Ryb3kuXG5cdTAwMWJbMG1cdTAwMWJbOTBtXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTAwMWJbMG1cblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfdGVhbS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmV4dGVybmFsLmVudjogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0tXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9yZXBvc2l0b3J5LnRlcnJhZm9ybS10ZW1wbGF0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfdGVhbV9tZW1iZXJzLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0cy5naF9zZWNyZXRzOiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0cy5naF9zZWNyZXRzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Z2hfc2VjcmV0c19uYW1lc3BhY2VdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc19pbmZyYWhvdXNlOFtcImF3cy1zMy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc19pbmZyYWhvdXNlOFtcImF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc19pbmZyYWhvdXNlOFtcImdpdGh1Yi1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMl1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzX2luZnJhaG91c2U4W1wiYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMl1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2w6YWt1em1pbnNreV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzX2luZnJhaG91c2U4W1wiYXdzLXMzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9zMy1RTUVhRFhdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3IuY29sbGFib3JhdG9yc1tcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOmFrdXptaW5za3ldXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc19pbmZyYWhvdXNlOFtcImdpdGh1Yi1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfZ2l0aHViLWlZTU5iM11cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6YWt1em1pbnNreV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMnxBV1NDVVJSRU5UXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNfaW5mcmFob3VzZThbXCJhd3MtczMtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc19pbmZyYWhvdXNlOFtcImdpdGh1Yi1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMnxBV1NDVVJSRU5UXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNfaW5mcmFob3VzZThbXCJhd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc19pbmZyYWhvdXNlOFtcImF3cy1zMy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9zMy1RTUVhRFh8QVdTQ1VSUkVOVF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQucHlwaV9hcGlfdG9rZW5bXCJpbmZyYWhvdXNlLXRvb2xraXRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpQWVBJX0FQSV9UT0tFTl1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNfaW5mcmFob3VzZThbXCJnaXRodWItY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfZ2l0aHViLWlZTU5iM3xBV1NDVVJSRU5UXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc19pbmZyYWhvdXNlOFtcImF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyfEFXU0NVUlJFTlRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLWF3cy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX2FjdGlvbnNfc2VjcmV0LmF3c19hY2Nlc3Nfa2V5X2lkW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbDpBV1NfQUNDRVNTX0tFWV9JRF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX2FjY2Vzc19rZXlfaWRbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpBV1NfQUNDRVNTX0tFWV9JRF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX3NlY3JldF9hY2Nlc3Nfa2V5W1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbDpBV1NfU0VDUkVUX0FDQ0VTU19LRVldXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX2FjdGlvbnNfc2VjcmV0LmF3c19zZWNyZXRfYWNjZXNzX2tleVtcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19TRUNSRVRfQUNDRVNTX0tFWV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0kydnU3TTRDQWljaV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0pDeGY1ODRDRWVhbV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0pDZWlVYzRDRVp2UV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfUk9MRVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6QVdTX1JPTEVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpBV1NfREVGQVVMVF9SRUdJT05dXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOkdIX1RPS0VOXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2w6QVdTX0RFRkFVTFRfUkVHSU9OXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpHSF9UT0tFTl1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfUk9MRVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2w6QVdTX1JPTEVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOkdIX1RPS0VOXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6QVdTX0RFRkFVTFRfUkVHSU9OXVx1MDAxYlswbSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGVcdTAwMWJbMG0lMEEgIFx1MDAxYlszM21+XHUwMDFiWzBtIHVwZGF0ZSBpbi1wbGFjZVx1MDAxYlswbSUwQVx1MDAxYlszMW0tXHUwMDFiWzBtL1x1MDAxYlszMm0rXHUwMDFiWzBtIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50XHUwMDFiWzBtJTBBIFx1MDAxYlszNm08PVx1MDAxYlswbSByZWFkIChkYXRhIHJlc291cmNlcylcdTAwMWJbMG0lMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEFcdTAwMWJbMW0gICMgZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW5cdTAwMWJbMG0gd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseSUwQSAgIyAoZGVwZW5kcyBvbiBhIHJlc291cmNlIG9yIGEgbW9kdWxlIHdpdGggY2hhbmdlcyBwZW5kaW5nKSUwQVx1MDAxYlswbSBcdTAwMWJbMzZtPD1cdTAwMWJbMG1cdTAwMWJbMG0gZGF0YSBcImF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvblwiIFwicHlwaV9hcGlfdG9rZW5cIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYXJuICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc2VjcmV0X2JpbmFyeSAgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHNlY3JldF9pZCAgICAgID0gXCJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tZGhJSTlQXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfc3RyaW5nICA9IChzZW5zaXRpdmUgdmFsdWUpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdmVyc2lvbl9pZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdmVyc2lvbl9zdGFnZXMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlblx1MDAxYlswbSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEFcdTAwMWJbMG0gIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldFwiIFwicHlwaV9hcGlfdG9rZW5cIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVBcIiUwQSAgICAgICMgXHUwMDFiWzMzbVdhcm5pbmdcdTAwMWJbMG06IHRoaXMgYXR0cmlidXRlIHZhbHVlIHdpbGwgYmUgbWFya2VkIGFzIHNlbnNpdGl2ZSBhbmQgd2lsbCBub3QlMEEgICAgICAjIGRpc3BsYXkgaW4gVUkgb3V0cHV0IGFmdGVyIGFwcGx5aW5nIHRoaXMgY2hhbmdlLlx1MDAxYlswbSBUaGUgdmFsdWUgaXMgdW5jaGFuZ2VkLiUwQSAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChzZW5zaXRpdmUgdmFsdWUpJTBBICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7fSUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDYgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIGdpdGh1Yl9hY3Rpb25zX3NlY3JldC5hd3NfYWNjZXNzX2tleV9pZFtcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl1cdTAwMWJbMG0gbXVzdCBiZSBcdTAwMWJbMW1cdTAwMWJbMzFtcmVwbGFjZWRcdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMzFtLVx1MDAxYlswbS9cdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwiYXdzX2FjY2Vzc19rZXlfaWRcIiB7JTBBICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlZF9hdCAgICAgID0gXCIyMDIzLTAzLTE5IDIxOjUyOjE5ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2w6QVdTX0FDQ0VTU19LRVlfSURcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgXHUwMDFiWzMxbSMgZm9yY2VzIHJlcGxhY2VtZW50XHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTAzLTE5IDIxOjUyOjE5ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgIFx1MDAxYls5MG0jICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBnaXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX2FjY2Vzc19rZXlfaWRbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl1cdTAwMWJbMG0gbXVzdCBiZSBcdTAwMWJbMW1cdTAwMWJbMzFtcmVwbGFjZWRcdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMzFtLVx1MDAxYlswbS9cdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwiYXdzX2FjY2Vzc19rZXlfaWRcIiB7JTBBICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlZF9hdCAgICAgID0gXCIyMDIzLTAzLTE5IDIxOjUyOjE1ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpBV1NfQUNDRVNTX0tFWV9JRFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSBcdTAwMWJbMzFtIyBmb3JjZXMgcmVwbGFjZW1lbnRcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDMtMTkgMjE6NTI6MTUgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIGdpdGh1Yl9hY3Rpb25zX3NlY3JldC5hd3Nfc2VjcmV0X2FjY2Vzc19rZXlbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdXHUwMDFiWzBtIG11c3QgYmUgXHUwMDFiWzFtXHUwMDFiWzMxbXJlcGxhY2VkXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzMxbS1cdTAwMWJbMG0vXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcImF3c19zZWNyZXRfYWNjZXNzX2tleVwiIHslMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDMtMTkgMjE6NTI6MTYgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbDpBV1NfU0VDUkVUX0FDQ0VTU19LRVlcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgXHUwMDFiWzMxbSMgZm9yY2VzIHJlcGxhY2VtZW50XHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTAzLTE5IDIxOjUyOjE2ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgIFx1MDAxYls5MG0jICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBnaXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX3NlY3JldF9hY2Nlc3Nfa2V5W1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdXHUwMDFiWzBtIG11c3QgYmUgXHUwMDFiWzFtXHUwMDFiWzMxbXJlcGxhY2VkXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzMxbS1cdTAwMWJbMG0vXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcImF3c19zZWNyZXRfYWNjZXNzX2tleVwiIHslMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDMtMTkgMjE6NTI6MTcgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19TRUNSRVRfQUNDRVNTX0tFWVwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSBcdTAwMWJbMzFtIyBmb3JjZXMgcmVwbGFjZW1lbnRcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDMtMTkgMjE6NTI6MTcgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIGdpdGh1Yl9hY3Rpb25zX3NlY3JldC5weXBpX2FwaV90b2tlbltcImluZnJhaG91c2UtdG9vbGtpdFwiXVx1MDAxYlswbSBtdXN0IGJlIFx1MDAxYlsxbVx1MDAxYlszMW1yZXBsYWNlZFx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlszMW0tXHUwMDFiWzBtL1x1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJweXBpX2FwaV90b2tlblwiIHslMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDItMTEgMjE6NTI6MDUgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpIFx1MDAxYlszMW0jIGZvcmNlcyByZXBsYWNlbWVudFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHVwZGF0ZWRfYXQgICAgICA9IFwiMjAyMy0wMi0xMSAyMTo1MjowNSArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICBcdTAwMWJbOTBtIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0FDQ0VTU19LRVlfSURcIl1cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIgeyUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGNyZWF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXBvc2l0b3J5ICAgICAgPSBcImF3cy1jb250cm9sXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19BQ0NFU1NfS0VZX0lEXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX1NFQ1JFVF9BQ0NFU1NfS0VZXCJdXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZCUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInNlY3JldFwiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJhd3MtY29udHJvbFwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc2VjcmV0X25hbWUgICAgID0gXCJBV1NfU0VDUkVUX0FDQ0VTU19LRVlcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHVwZGF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfQUNDRVNTX0tFWV9JRFwiXVx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlcG9zaXRvcnkgICAgICA9IFwiYXdzLXMzLWNvbnRyb2xcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHNlY3JldF9uYW1lICAgICA9IFwiQVdTX0FDQ0VTU19LRVlfSURcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHVwZGF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfU0VDUkVUX0FDQ0VTU19LRVlcIl1cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIgeyUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGNyZWF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXBvc2l0b3J5ICAgICAgPSBcImF3cy1zMy1jb250cm9sXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19TRUNSRVRfQUNDRVNTX0tFWVwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdXBkYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19BQ0NFU1NfS0VZX0lEXCJdXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZCUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInNlY3JldFwiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJnaXRodWItY29udHJvbFwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc2VjcmV0X25hbWUgICAgID0gXCJBV1NfQUNDRVNTX0tFWV9JRFwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdXBkYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19TRUNSRVRfQUNDRVNTX0tFWVwiXVx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlcG9zaXRvcnkgICAgICA9IFwiZ2l0aHViLWNvbnRyb2xcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHNlY3JldF9uYW1lICAgICA9IFwiQVdTX1NFQ1JFVF9BQ0NFU1NfS0VZXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEFcdTAwMWJbMW1QbGFuOlx1MDAxYlswbSAxMSB0byBhZGQsIDEgdG8gY2hhbmdlLCA1IHRvIGRlc3Ryb3kuJTBBXHUwMDFiWzBtXHUwMDFiWzkwbSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MDAxYlswbSUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwXG4iLCAic3RkZXJyIjogIiIsICJhZGQiOiAxMSwgImNoYW5nZSI6IDEsICJkZXN0cm95IjogNX19```
</p></details>